In [1]:
import pandas as pd
import numpy as np

In [2]:
boy = pd.read_csv('boy1.csv')
girl = pd.read_csv('girl1.csv')

In [5]:
boy.pop("Unnamed: 0")

0          0
1          1
2          2
3          3
4          4
        ...
1219    1219
1220    1220
1221    1221
1222    1222
1223    1223
Name: Unnamed: 0, Length: 1224, dtype: int64

In [6]:
boy

            Name Gender
0       An Khang      M
1         Ân Lai      M
2         An Nam      M
3      An Nguyên      M
4        An Ninh      M
...          ...    ...
1219  Xuân Tường      M
1220     Xuân Vũ      M
1221    Yên Bằng      M
1222    Yên Bình      M
1223     Yên Sơn      M

[1224 rows x 2 columns]

In [7]:
girl.pop("Unnamed: 0")

0          0
1          1
2          2
3          3
4          4
        ...
1305    1305
1306    1306
1307    1307
1308    1308
1309    1309
Name: Unnamed: 0, Length: 1310, dtype: int64

In [8]:
girl

            Name Gender
0        An Bình      F
1          An Di      F
2          An Hạ      F
3        An Hằng      F
4         An Khê      F
...          ...    ...
1305  Đông Tuyền      F
1306     Đông Vy      F
1307   Đơn Thuần      F
1308    Đức Hạnh      F
1309     Ấu Lăng      F

[1310 rows x 2 columns]

In [18]:
bigdata = pd.concat([girl, boy], ignore_index=True, sort=False)

In [21]:
bigdata.to_csv('final_data.csv')

In [22]:
bigdata

            Name Gender
0        An Bình      F
1          An Di      F
2          An Hạ      F
3        An Hằng      F
4         An Khê      F
...          ...    ...
2529  Xuân Tường      M
2530     Xuân Vũ      M
2531    Yên Bằng      M
2532    Yên Bình      M
2533     Yên Sơn      M

[2534 rows x 2 columns]